Table of Contents
 Class ConnectionIdentifier<T>
Namespace
IdeaStatiCa.BimApiLink.Identifiers
Assembly
IdeaStatiCa.BimApiLink.dll
public class ConnectionIdentifier<T> : ImmutableIdentifier<T>, IIdentifier, IIdeaPersistenceToken, IEquatable<IIdentifier> where T : IIdeaObject
Type Parameters
T
Inheritance
object
Identifier<T>
ImmutableIdentifier<T>
ConnectionIdentifier<T>
Implements
IIdentifier
IIdeaPersistenceToken
IEquatable<IIdentifier>
Inherited Members
 ImmutableIdentifier<T>.GetStringId()
 ImmutableIdentifier<T>.GetId()
 Identifier<T>.ObjectType
 Identifier<T>.Equals(IIdentifier)
 Identifier<T>.Equals(object)
 Identifier<T>.GetHashCode()
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 ConnectionIdentifier(double, double, double)
public ConnectionIdentifier(double X, double Y, double Z)
Parameters
X double
Y double
Z double
Properties
 AnchorGrids
public IList<ImmutableIdentifier<IIdeaAnchorGrid>> AnchorGrids { get; set; }
Property Value
IList<ImmutableIdentifier<IIdeaAnchorGrid>>
 BoltGrids
public IList<ImmutableIdentifier<IIdeaBoltGrid>> BoltGrids { get; set; }
Property Value
IList<ImmutableIdentifier<IIdeaBoltGrid>>
 ConnectedMembers
public IList<ImmutableIdentifier<IIdeaConnectedMember>> ConnectedMembers { get; set; }
Property Value
IList<ImmutableIdentifier<IIdeaConnectedMember>>
 Cuts
public IList<ImmutableIdentifier<IIdeaCut>> Cuts { get; set; }
Property Value
IList<ImmutableIdentifier<IIdeaCut>>
 FoldedPlates
public IList<ImmutableIdentifier<IIdeaFoldedPlate>> FoldedPlates { get; set; }
Property Value
IList<ImmutableIdentifier<IIdeaFoldedPlate>>
 Node
public Identifier<IIdeaNode> Node { get; set; }
Property Value
Identifier<IIdeaNode>
 Plates
public IList<ImmutableIdentifier<IIdeaPlate>> Plates { get; set; }
Property Value
IList<ImmutableIdentifier<IIdeaPlate>>
 Welds
public IList<ImmutableIdentifier<IIdeaWeld>> Welds { get; set; }
Property Value
IList<ImmutableIdentifier<IIdeaWeld>>
 Edit this page